In [1]:
import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

from pyspark import SparkConf
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import *
from pyspark.sql.window import Window as W

Setting up user arguements for connecting.

In [2]:
mysql_args = {
    "uid": "root",
    "pwd": "WreckedRatUVA123!",
    "hostname": "localhost",
    "dbname": "adventureworks"
}

dst_dbname = "adventure_dw2"

# The 'cluster_location' must either be "atlas" or "local".
mongodb_args = {
    "user_name" : "dev",
    "password" : "abc123!",
    "cluster_name" : "Cluster0",
    "cluster_subnet" : "zyvokl5",
    "cluster_location" : "atlas", # "local"
    "db_name" : "northwind_purchasing"
}

Setting up methods to connect to Databases.

In [3]:
def get_sql_dataframe(sql_query, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    dframe = pd.read_sql(text(sql_query), connection);
    connection.close()
    
    return dframe
    

def set_dataframe(df, table_name, pk_column, db_operation, **args):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        connection.execute(text(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});"))
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()


def get_mongo_client(**args):
    '''Validate proper input'''
    if args["cluster_location"] not in ['atlas', 'local']:
        raise Exception("You must specify either 'atlas' or 'local' for the cluster_location parameter.")
    
    else:
        if args["cluster_location"] == "atlas":
            connect_str = f"mongodb+srv://{args['user_name']}:{args['password']}@"
            connect_str += f"{args['cluster_name']}.{args['cluster_subnet']}.mongodb.net"
            client = pymongo.MongoClient(connect_str, tlsCAFile=certifi.where())
            
        elif args["cluster_location"] == "local":
            client = pymongo.MongoClient("mongodb://localhost:27017/")
        
    return client


def get_mongo_dataframe(mongo_client, db_name, collection, query):
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = mongo_client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    mongo_client.close()
    
    return dframe


def set_mongo_collections(mongo_client, db_name, data_directory, json_files):
    db = mongo_client[db_name]
    
    for file in json_files:
        db.drop_collection(file)
        json_file = os.path.join(data_directory, json_files[file])
        with open(json_file, 'r') as openfile:
            json_object = json.load(openfile)
            file = db[file]
            result = file.insert_many(json_object)
        
    mongo_client.close()

I got the JSON file from exporting the table as a JSON file, and I input it into my MongoDB, the file is the JSON one. 
Lets first get the JSON table.

In [4]:

mongo_client = get_mongo_client(**mongodb_args)
customer_addresses_df = get_mongo_dataframe(
    mongo_client,
    db_name='AdventureWorks',
    collection='Addresses',
    query={}
)

if '_id' in customer_addresses_df.columns:
    customer_addresses_df = customer_addresses_df.drop(columns=['_id', 'id', 'rowguid', 'ModifiedDate'])

The CSV file I also got exporting the table as a CSV file, and its apart of the local file structure. Lets get the information from that.

In [5]:
products_df = pd.read_csv("product.csv")

Lets Create Our Two Dimension Tables (Not Dimension Date). 
First is the Customer Table

In [6]:
sql_query = """
SELECT c.CustomerID,
       c.AccountNumber,
       c.CustomerType,
       st.Group AS SalesTerritoryGroup,
       st.Name AS SalesTerritory
FROM customer AS c
INNER JOIN salesterritory AS st
ON c.TerritoryID = st.TerritoryID;
"""
customers_df = get_sql_dataframe(sql_query, **mysql_args)
# Get Customers form sql
addresses_query = """
SELECT AddressID, AddressLine1, AddressLine2, City, PostalCode
FROM address;
"""
addresses_df = get_sql_dataframe(addresses_query, **mysql_args)

customer_with_addr = customers_df.merge(customer_addresses_df, on='CustomerID', how ='inner')
#Merge it with the each other 

dim_customer = customer_with_addr.merge(addresses_df, on="AddressID", how='left')
#Merged with the addresses_df

dim_customer = dim_customer.drop_duplicates(subset=['CustomerID'])

print(dim_customer.columns)

Index(['CustomerID', 'AccountNumber', 'CustomerType', 'SalesTerritoryGroup',
       'SalesTerritory', 'rowguid', 'AddressID', 'ModifiedDate',
       'AddressTypeID', 'AddressLine1', 'AddressLine2', 'City', 'PostalCode'],
      dtype='object')

This has some unwanted columns lets clean it up.

In [7]:
dim_customer = dim_customer[[
    'CustomerID',
    'AccountNumber',
    'CustomerType',
    'SalesTerritoryGroup',
    'SalesTerritory',
    'AddressLine1',
    'City',
    'PostalCode'
]]
dim_customer.head()

,CustomerID,AccountNumber,CustomerType,SalesTerritoryGroup,SalesTerritory,AddressLine1,City,PostalCode
0,1,AW00000001,S,North America,Northwest,2251 Elliot Avenue,Seattle,98104
1,2,AW00000002,S,North America,Northwest,7943 Walnut Ave,Renton,98055
3,3,AW00000003,S,North America,Southwest,12345 Sterling Avenue,Irving,75061
4,4,AW00000004,S,North America,Southwest,800 Interchange Blvd.,Austin,78701
6,5,AW00000005,S,North America,Southwest,482505 Warm Springs Blvd.,Fremont,94536

Lets Create Our Products Table

In [8]:
productmodel_query = """
SELECT ProductModelID, Name AS ProductModel
FROM productmodel;
"""

productmodel_df = get_sql_dataframe(productmodel_query, **mysql_args)

product_category_query = """
SELECT psc.ProductSubcategoryID, psc.Name AS ProductSubcategory, 
       pc.ProductCategoryID, pc.Name AS ProductCategory
FROM productsubcategory AS psc
INNER JOIN productcategory AS pc
ON psc.ProductCategoryID = pc.ProductCategoryID;
"""
product_category_df = get_sql_dataframe(product_category_query, **mysql_args)

products_with_cat = products_df.merge(product_category_df, on='ProductSubcategoryID', how='left')

dim_product = products_with_cat.merge(productmodel_df, on='ProductModelID', how='left')

print(dim_product.columns)

Index(['ProductID', 'Name', 'ProductNumber', 'MakeFlag', 'FinishedGoodsFlag',
       'Color', 'SafetyStockLevel', 'ReorderPoint', 'StandardCost',
       'ListPrice', 'Size', 'SizeUnitMeasureCode', 'WeightUnitMeasureCode',
       'Weight', 'DaysToManufacture', 'ProductLine', 'Class', 'Style',
       'ProductSubcategoryID', 'ProductModelID', 'SellStartDate',
       'SellEndDate', 'DiscontinuedDate', 'rowguid', 'ModifiedDate',
       'ProductSubcategory', 'ProductCategoryID', 'ProductCategory',
       'ProductModel'],
      dtype='object')

In [9]:
dim_product = dim_product[[
    'ProductID',
    'Name',
    'ProductNumber',
    'MakeFlag',
    'FinishedGoodsFlag',
    'SafetyStockLevel',
    'ReorderPoint',
    'DaysToManufacture',
    'SellStartDate',
]]
dim_product.head()

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,SafetyStockLevel,ReorderPoint,DaysToManufacture,SellStartDate
0,1,Adjustable Race,AR-5381,b'\x00',b'\x00',1000,750,0,1998-06-01
1,2,Bearing Ball,BA-8327,b'\x00',b'\x00',1000,750,0,1998-06-01
2,3,BB Ball Bearing,BE-2349,b'\x01',b'\x00',800,600,1,1998-06-01
3,4,Headset Ball Bearings,BE-2908,b'\x00',b'\x00',800,600,0,1998-06-01
4,316,Blade,BL-2036,b'\x01',b'\x00',800,600,1,1998-06-01

Lets make a Dimension Employee Table

In [25]:

employee_query = """
SELECT e.EmployeeID,
       e.Title,
       e.HireDate,
       e.BirthDate,
       e.Gender,
       e.MaritalStatus,
       e.ManagerID,
       e.VacationHours,
       e.SickLeaveHours
FROM employee AS e;
"""

employee_df = get_sql_dataframe(employee_query, **mysql_args)

employeedepartment_query = """
SELECT ed.EmployeeID,
       d.Name AS DepartmentName
FROM employeedepartmenthistory AS ed
INNER JOIN department AS d
ON ed.DepartmentID = d.DepartmentID
WHERE ed.EndDate IS NULL;
"""

employeedepartment_df = get_sql_dataframe(employeedepartment_query, **mysql_args)

dim_employee = employee_df.merge(employeedepartment_df, on='EmployeeID', how='left')

dim_employee = dim_employee[[
    'EmployeeID', 'Title', 'BirthDate', 'HireDate', 'Gender', 
    'MaritalStatus', 'DepartmentName', 'ManagerID', 'VacationHours', 'SickLeaveHours'
]]

dim_employee.head()

,EmployeeID,Title,BirthDate,HireDate,Gender,MaritalStatus,DepartmentName,ManagerID,VacationHours,SickLeaveHours
0,1,Production Technician - WC60,1972-05-15,1996-07-31,M,M,Production,16.0,21,30
1,2,Marketing Assistant,1977-06-03,1997-02-26,M,S,Marketing,6.0,42,41
2,3,Engineering Manager,1964-12-13,1997-12-12,M,M,Engineering,12.0,2,21
3,4,Senior Tool Designer,1965-01-23,1998-01-05,M,S,Tool Design,3.0,48,80
4,5,Tool Designer,1949-08-29,1998-01-11,M,M,Tool Design,263.0,9,24

Lets make a diemsnion date table

In [10]:

begin_date = '2000-01-01'
end_date = '2010-12-31'

dates = pd.date_range(start=begin_date, end=end_date, freq='D')

dim_date = pd.DataFrame({
    'full_date': dates
})

dim_date['date_key'] = dim_date['full_date'].dt.strftime('%Y%m%d').astype(int)
dim_date['date_name'] = dim_date['full_date'].dt.strftime('%Y/%m/%d')
dim_date['date_name_us'] = dim_date['full_date'].dt.strftime('%m/%d/%Y')
dim_date['date_name_eu'] = dim_date['full_date'].dt.strftime('%d/%m/%Y')
dim_date['day_of_week'] = dim_date['full_date'].dt.weekday + 1  # 1=Monday
dim_date['day_name_of_week'] = dim_date['full_date'].dt.day_name()
dim_date['day_of_month'] = dim_date['full_date'].dt.day
dim_date['day_of_year'] = dim_date['full_date'].dt.dayofyear
dim_date['weekday_weekend'] = dim_date['day_name_of_week'].apply(
    lambda x: 'Weekend' if x in ['Saturday','Sunday'] else 'Weekday'
)
dim_date['week_of_year'] = dim_date['full_date'].dt.isocalendar().week
dim_date['month_name'] = dim_date['full_date'].dt.month_name()
dim_date['month_of_year'] = dim_date['full_date'].dt.month
dim_date['is_last_day_of_month'] = dim_date['full_date'].dt.is_month_end.map({True:'Y', False:'N'})
dim_date['calendar_quarter'] = dim_date['full_date'].dt.quarter
dim_date['calendar_year'] = dim_date['full_date'].dt.year
dim_date['calendar_year_month'] = dim_date['full_date'].dt.strftime('%Y-%m')
dim_date['calendar_year_qtr'] = dim_date['full_date'].dt.year.astype(str) + 'Q' + dim_date['calendar_quarter'].astype(str)

fiscal_offset = 6  # months offset for fiscal year

fiscal_date = dim_date['full_date'] + pd.DateOffset(months=fiscal_offset)
dim_date['fiscal_month_of_year'] = fiscal_date.dt.month
dim_date['fiscal_quarter'] = fiscal_date.dt.quarter
dim_date['fiscal_year'] = fiscal_date.dt.year
dim_date['fiscal_year_month'] = fiscal_date.dt.strftime('%Y-%m')
dim_date['fiscal_year_qtr'] = fiscal_date.dt.year.astype(str) + 'Q' + fiscal_date.dt.quarter.astype(str)

print(dim_date.head())

   full_date  date_key   date_name date_name_us date_name_eu  day_of_week  \
0 2000-01-01  20000101  2000/01/01   01/01/2000   01/01/2000            6
1 2000-01-02  20000102  2000/01/02   01/02/2000   02/01/2000            7
2 2000-01-03  20000103  2000/01/03   01/03/2000   03/01/2000            1
3 2000-01-04  20000104  2000/01/04   01/04/2000   04/01/2000            2
4 2000-01-05  20000105  2000/01/05   01/05/2000   05/01/2000            3

  day_name_of_week  day_of_month  day_of_year weekday_weekend  ...  \
0         Saturday             1            1         Weekend  ...
1           Sunday             2            2         Weekend  ...
2           Monday             3            3         Weekday  ...
3          Tuesday             4            4         Weekday  ...
4        Wednesday             5            5         Weekday  ...

   is_last_day_of_month calendar_quarter  calendar_year calendar_year_month  \
0                     N                1           2000             2000-01
1                     N                1           2000             2000-01
2                     N                1           2000             2000-01
3                     N                1           2000             2000-01
4                     N                1           2000             2000-01

   calendar_year_qtr  fiscal_month_of_year fiscal_quarter fiscal_year  \
0             2000Q1                     7              3        2000
1             2000Q1                     7              3        2000
2             2000Q1                     7              3        2000
3             2000Q1                     7              3        2000
4             2000Q1                     7              3        2000

   fiscal_year_month  fiscal_year_qtr
0            2000-07           2000Q3
1            2000-07           2000Q3
2            2000-07           2000Q3
3            2000-07           2000Q3
4            2000-07           2000Q3

[5 rows x 23 columns]

Lets make our Fact Table

In [30]:
sales_query = """
SELECT soh.SalesOrderID,
       soh.OrderDate,
       soh.ShipDate,
       soh.CustomerID,
       sod.ProductID,
       soh.SalesPersonID AS EmployeeID,
       sod.OrderQty,
       sod.UnitPrice,
       sod.LineTotal
FROM salesorderheader AS soh
INNER JOIN salesorderdetail AS sod
ON soh.SalesOrderID = sod.SalesOrderID;
"""
sales_df = get_sql_dataframe(sales_query, **mysql_args)

sales_df['order_date_key'] = sales_df['OrderDate'].dt.strftime('%Y%m%d').astype(int)
sales_df['ship_date_key'] = sales_df['ShipDate'].dt.strftime('%Y%m%d').astype(int)

fact_sales = sales_df[[
    'SalesOrderID',      
    'CustomerID',        
    'ProductID',
    'EmployeeID',
    'order_date_key',    
    'ship_date_key',     
    'OrderQty',
    'UnitPrice',
    'LineTotal'
    
]]

fact_sales.head()

,SalesOrderID,CustomerID,ProductID,EmployeeID,order_date_key,ship_date_key,OrderQty,UnitPrice,LineTotal
0,43659,676,776,279.0,20010701,20010708,1,2024.994,2024.994
1,43659,676,777,279.0,20010701,20010708,3,2024.994,6074.982
2,43659,676,778,279.0,20010701,20010708,1,2024.994,2024.994
3,43659,676,771,279.0,20010701,20010708,1,2039.994,2039.994
4,43659,676,772,279.0,20010701,20010708,1,2039.994,2039.994

Lets put it into the SQL as a data warehouse.

In [33]:
mysql_args_dw2 = {
    'uid': 'root',
    'pwd': 'WreckedRatUVA123!',
    'hostname': 'localhost',
    'dbname': 'adventure_dw2'
}
set_dataframe(dim_customer, table_name='dim_customer', pk_column='CustomerID', db_operation='insert', **mysql_args_dw2)

set_dataframe(dim_product, table_name='dim_product', pk_column='ProductID', db_operation='insert', **mysql_args_dw2)

set_dataframe(dim_date, table_name='dim_date', pk_column='date_key', db_operation='insert', **mysql_args_dw2)

set_dataframe(dim_employee, table_name='dim_employee', pk_column='EmployeeID', db_operation='insert', **mysql_args_dw2)

# If I set_dataframe(fact_sales, table_name='fact_sales', pk_column='SalesOrderID', db_operation='insert', **mysql_args_dw2),
# this will cause an error due to SalesOrderID having many products which will be a line per fact_sales. This cause an error.
# TO fix this we just add ProductID as an additional key. 

set_dataframe(fact_sales, table_name='fact_sales', pk_column='SalesOrderID, ProductID', db_operation='insert', **mysql_args_dw2)

Lets try some SQL queries to see if it works:

In [32]:
query = """
SELECT 
    c.CustomerID,
    c.AccountNumber,
    d.calendar_year,
    SUM(f.LineTotal) AS TotalSales,
    SUM(f.OrderQty) AS TotalQuantity,
    COUNT(DISTINCT f.SalesOrderID) AS NumOrders
FROM fact_sales AS f
INNER JOIN dim_customer AS c
    ON f.CustomerID = c.CustomerID
INNER JOIN dim_date AS d
    ON f.order_date_key = d.date_key
GROUP BY 
    c.CustomerID, 
    c.AccountNumber, 
    d.calendar_year
ORDER BY 
    TotalSales DESC;
"""

fact_sales_summary = get_sql_dataframe(query, **mysql_args_dw2)
display(fact_sales_summary.head(10))

,CustomerID,AccountNumber,calendar_year,TotalSales,TotalQuantity,NumOrders
0,546,AW00000546,2003,368440.986055,1023.0,4
1,697,AW00000697,2003,361627.850036,762.0,4
2,72,AW00000072,2003,360839.913145,782.0,4
3,514,AW00000514,2002,336746.332033,868.0,4
4,328,AW00000328,2003,328615.655400,718.0,4
5,167,AW00000167,2002,328362.935800,590.0,4
6,599,AW00000599,2003,324308.785626,829.0,2
7,170,AW00000170,2003,323324.431024,539.0,4
8,170,AW00000170,2002,317507.389800,469.0,4
9,678,AW00000678,2002,316681.803773,793.0,4

This shows us the highest revenue by each customer.

For Project 2 we need to provide some JSON files for MONGO Database to get and access for the DIM tables. As well as CSV files to store for Spark to get and put in the database. The MYSQL has the data warehouse already we can get he dim date from there and we can also get employee data there as well.

We will make DIM Product into a json file that we can easily replicate into the Spark server.

In [43]:
dim_product.to_json(f"dim_product.json", orient='records')

Ill manually put it into the MongoDB. 

Lets make split the facts order into multiple files for streaming.

In [46]:
import numpy as np

fact_sales_split = np.array_split(fact_sales, 3)

output_dir = "./streaming"

for i, part in enumerate(fact_sales_split, start=1):
    file_path = os.path.join(output_dir, f"fact_sales_{i}.json")
    part.to_json(file_path, orient='records', lines=True)

Now lets makes a CSV File for DimCustomer

In [48]:
output_dir = "./batch"
file_path = os.path.join(output_dir, "dim_customer.csv")

dim_customer.to_csv(file_path, index=False)